--- ПРОГРАММА НА 3 ---
print("Введите число")
a = io.read("*n")

V = a*a*a
S = a*a*6

print("V куба =  ",V)
print("S куба = ",S)

--- ПРОГРАММА НА 4 ---
print("Введите радиус внешнего круга")
a = io.read("*n")
print("Введите радиус внутреннего круга")
b = io.read("*n")

c = math.pi
S = c*(a*a-b*b)

print("S кольца = ",S)

--- ПРОГРАММА НА 5 ---
print("Введите длину основания трапеции")
a = io.read("*n")
print("Введите длину второго основания трапеции")
b = io.read("*n")
print("Введите высоту трапеции")
h = io.read("*n")

S = ((a+b)/2)*h

print("S трапеции = ",S)