--- ПРОГРАММА НА 3 ---
print("Введите рост родителей")
m = io.read("*n")
w = io.read("*n")

s = (m+w)/2
b = s+6.4
g = s-6.4

print("Для мальчика = ", b)
print("Для девочки = ", g)

--- ПРОГРАММА НА 4 ---
print("Введите возраст мужчины")
m=io.read("*n")

w = m/2 + 7

print("Идеальный возраст женщины = ", w)
print("Введите возраст женщины")
s = io.read("*n")

im = s*2 -17
print("Идеальный возраст мужчины = ", im)

--- ПРОГРАММА НА 5 ---
print("Введите кол-во секунд")
k = io.read("*n")
h = math.floor(k/3600)
k = k-h

m = math.floor(k/60)
k = k-m*60
print("Это ", h, " часов ", m, " минут ", k, " секунд")